data_analysis/repo/gpu_log/benchmark_20250628_162239_mDeepSeek-R1-Distill-Llama-70B_np200_mc50_in2048_out1024.log
INFO 06-28 16:22:44 [__init__.py:243] Automatically detected platform cuda.
Namespace(backend='vllm', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=50, model='deepseek-ai/DeepSeek-R1-Distill-Llama-70B', tokenizer=None, use_beam_search=False, num_prompts=200, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['input_len=2048', 'output_len=1024', 'serving=dynamo_vllm'], result_dir='gpu_log', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=2048, random_output_len=1024, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 50
100%|██████████| 200/200 [01:19<00:00,  2.52it/s]
============ Serving Benchmark Result ============
Successful requests:                     200       
Benchmark duration (s):                  79.21     
Total input tokens:                      409400    
Total generated tokens:                  139503    
Request throughput (req/s):              2.52      
Output token throughput (tok/s):         1761.21   
Total Token throughput (tok/s):          6929.83   
---------------Time to First Token----------------
Mean TTFT (ms):                          151.04    
Median TTFT (ms):                        78.78     
P99 TTFT (ms):                           363.96    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          24.76     
Median TPOT (ms):                        25.50     
P99 TPOT (ms):                           26.98     
---------------Inter-token Latency----------------
Mean ITL (ms):                           24.69     
Median ITL (ms):                         22.62     
P99 ITL (ms):                            59.38     
==================================================