data_analysis/repo/gpu_log/benchmark_20250628_190028_mDeepSeek-R1-Distill-Llama-70B_np200_mc120_in1536_out1024.log
INFO 06-28 19:00:34 [__init__.py:243] Automatically detected platform cuda.
Namespace(backend='vllm', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=120, model='deepseek-ai/DeepSeek-R1-Distill-Llama-70B', tokenizer=None, use_beam_search=False, num_prompts=200, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['input_len=1536', 'output_len=1024', 'serving=dynamo_vllm'], result_dir='gpu_log', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1536, random_output_len=1024, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 120
100%|██████████| 200/200 [00:52<00:00,  3.80it/s]
============ Serving Benchmark Result ============
Successful requests:                     200       
Benchmark duration (s):                  52.57     
Total input tokens:                      307000    
Total generated tokens:                  139365    
Request throughput (req/s):              3.80      
Output token throughput (tok/s):         2651.17   
Total Token throughput (tok/s):          8491.31   
---------------Time to First Token----------------
Mean TTFT (ms):                          694.77    
Median TTFT (ms):                        1073.65   
P99 TTFT (ms):                           1113.29   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          34.26     
Median TPOT (ms):                        35.47     
P99 TPOT (ms):                           41.62     
---------------Inter-token Latency----------------
Mean ITL (ms):                           33.89     
Median ITL (ms):                         31.15     
P99 ITL (ms):                            98.10     
==================================================